# <font color=lightblue>Pandas II - Aplicações na Vida Real </font>

# <font color=lightblue>Sumário</font>

- ### <font color=lightpink>1. Introdução </font>
        
        1.1 Apresentação das bases de dados
        1.2 Loc e iloc

- ### <font color=lightpink>2. Métodos Úteis </font>
        
        2.1 Agrupamento
        2.1.1 Groupby
        2.1.2 Pivot Table
        2.1.3 Melt
        
        2.2.1 Diff
        2.2.2 Pct_change

- ### <font color=lightpink>3. Aplicações Úteis </font>

        3.1 Cálculo de retorno
        3.2 Melhores retornos para cada fundos
        3.3 Juntando os Resultados

In [1]:
pip install pandas

Requirement already satisfied: pandas in /home/codespace/.local/lib/python3.10/site-packages (2.0.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in /home/codespace/.local/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
import pandas as pd
import numpy as np

## 1. Introdução

### 1.1 Apresentação da base de dados "Latest_Data_Science_Salaries.csv"

##### O método info() é usado para obter informações sobre o DataFrame, como o número de entradas, o tipo de dados de cada coluna, o uso de memória, entre outros detalhes.

In [4]:
salaries_df = pd.read_csv("Latest_Data_Science_Salaries.csv")
salaries_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3300 entries, 0 to 3299
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Job Title           3300 non-null   object
 1   Employment Type     3300 non-null   object
 2   Experience Level    3300 non-null   object
 3   Expertise Level     3300 non-null   object
 4   Salary              3300 non-null   int64
 5   Salary Currency     3300 non-null   object
 6   Company Location    3300 non-null   object
 7   Salary in USD       3300 non-null   int64
 8   Employee Residence  3300 non-null   object
 9   Company Size        3300 non-null   object
 10  Year                3300 non-null   int64
dtypes: int64(3), object(8)
memory usage: 283.7+ KB

##### O método describe() é usado para gerar estatísticas descritivas sobre o DataFrame, como contagem, média, desvio padrão, mínimo, quartis e máximo. Ele fornece um resumo estatístico das colunas numéricas do DataFrame.

In [ ]:
salaries_df.describe()

##### O método head() é usado para exibir as primeiras linhas do DataFrame. Por padrão, ele exibe as 5 primeiras linhas.

In [ ]:
salaries_df.head()

### Loc e iloc

##### O '.loc' é útil quando você deseja realizar operações no DataFrame usando rótulos de linhas e colunas, em vez de índices numéricos. Ele oferece uma maneira mais intuitiva e explícita de acessar e modificar os dados.

In [ ]:
#Acessar uma única linha com base no rótulo da linha:
salaries_df.loc[4]

In [ ]:
#Acessar uma única coluna com base no rótulo da coluna:
salaries_df.loc[:, "Job Title"]

In [ ]:
#Acessar mais de uma linha com base no rótulo das linhas:
salaries_df.loc[2:5]

In [ ]:
#Acessar mais de uma coluna com base no rótulo das colunas:
salaries_df.loc[:,["Salary", "Experience Level"]]

In [ ]:
#Acessar mais de uma linha e coluna com base no rótulo das linhas e das colunas:
salaries_df.loc[2:5, ["Salary", "Experience Level"]]

##### O .iloc é um atributo do DataFrame do Pandas que permite acessar e modificar os valores com base em índices numéricos de linhas e colunas. Ao contrário do .loc, que usa rótulos de linhas e colunas, o .iloc é usado para indexação baseada em índices numéricos.

In [ ]:
#Acessar uma única linha com base no número da linha:
salaries_df.iloc[0]

In [ ]:
#Acessar linhas e colunas com base no alcance:
salaries_df.iloc[range(2), range(1)]

In [ ]:
#Acessar mais de uma linha com base no número das linhas:
salaries_df.iloc[[9, 5, 6]]

In [ ]:
##Acessar mais de uma linha e mais de uma coluna com base no número das linhas e das colunas:
salaries_df.iloc[[5,6,7],[1,2,3]]

### Retorno a apresentação das bases

In [ ]:
#Unique é usado para retornar os valores únicos presentes, ou seja, todas as respostas possíveis.
salaries_df['Experience Level'].unique()

In [7]:
print(len(salaries_df["Salary"].unique()), "vs", len(salaries_df.columns))
print(salaries_df["Salary"].unique()[0])

1071 vs 11
210000.0

#### Set Theory

In [8]:
# acessar colunas do dataframe salários
salaries_df.columns

Index(['Job Title', 'Employment Type', 'Experience Level', 'Expertise Level',
       'Salary', 'Salary Currency', 'Company Location', 'Salary in USD',
       'Employee Residence', 'Company Size', 'Year'],
      dtype='object')

In [15]:
# código para encontrar os valores únicos presentes na coluna "Experience Level" do DataFrame "salaries_df" que não estão presentes na coluna "Expertise Level".
set(salaries_df['Experience Level'].unique()).difference(salaries_df["Expertise Level"].unique())

{'Entry', 'Executive', 'Mid', 'Senior'}

In [16]:
# código usado para encontrar os valores únicos presentes na coluna "Expertise Level" do DataFrame "salaries_df" que não estão presentes na coluna "Experience Level".
set(salaries_df["Expertise Level"].unique()).difference(salaries_df['Experience Level'].unique())

{'Director', 'Expert', 'Intermediate', 'Junior'}

In [23]:
# este código é usado para filtrar o DataFrame "salaries_df" com base em uma condição e selecionar as colunas "Company Location" e "Employee Residence". 
salaries_df.loc[salaries_df["Company Location"].isin(salaries_df['Employee Residence']), ["Company Location", "Employee Residence"]].drop_duplicates()

     Company Location Employee Residence
0       United States      United States
8      United Kingdom     United Kingdom
12            Germany            Germany
13             Sweden            Germany
30              India              India
...               ...                ...
3265           France      United States
3270       Luxembourg         Luxembourg
3277       Luxembourg             France
3291           Israel          Singapore
3293            Malta              Malta

[141 rows x 2 columns]

In [22]:
# este código é usado para filtrar o DataFrame "salaries_df" com base em uma condição, selecionar a coluna "Company Location" para as linhas que atendem à condição e retornar os valores únicos dessa coluna.
salaries_df.loc[salaries_df["Company Location"].isin(salaries_df['Employee Residence']), "Company Location"].unique()

array(['United States', 'United Kingdom', 'Germany', 'Sweden', 'India',
       nan, 'Spain', 'Estonia', 'France', 'Philippines', 'Canada',
       'Australia', 'Turkey', 'Portugal', 'Brazil', 'Switzerland',
       'Andorra', 'Netherlands', 'Ecuador', 'Mexico', 'Nigeria',
       'Saudi Arabia', 'Colombia', 'Poland', 'Norway', 'Ghana',
       'Argentina', 'Japan', 'Russian Federation', 'South Africa',
       'Italy', 'Hong Kong', 'Central African Republic', 'Finland',
       'Ukraine', 'Ireland', 'Israel', 'Singapore', 'Slovenia',
       'Thailand', 'Croatia', 'Armenia', 'Bosnia and Herzegovina',
       'Kenya', 'Latvia', 'Romania', 'Pakistan', 'Lithuania', 'Hungary',
       'Austria', 'Puerto Rico', 'American Samoa', 'Greece', 'Denmark',
       'Belgium', 'Indonesia', 'Egypt', 'United Arab Emirates',
       'Malaysia', 'Honduras', 'Czechia', 'Algeria', 'Iraq', 'China',
       'New Zealand', 'Chile', 'Luxembourg', 'Malta'], dtype=object)

## 2. Métodos Úteis para analise de dados

### 2.1.1 Groupby

Groupby = "agrupar por"
Ao agrupar uma coluna pelas suas catorias, permite realizar operações agregadas, como soma ou contagem, aos grupos resultantes.

As perguntas :"Sera que o salario muda dependendo do emprego da pessoa?" 
              "Sera que o salario varia de acordo com o porte da empresa?"
              "Sera que o salario tem alguma relacao com a origem das empresas?"

In [5]:
#respondendo a primeira pergunta
df1=salaries_df[['Job Title','Salary']]
df1

                     Job Title   Salary
0                Data Engineer   210000
1                Data Engineer   165000
2                Data Engineer   185900
3                Data Engineer   129300
4               Data Scientist   140000
...                        ...      ...
3295            Data Scientist   412000
3296  Principal Data Scientist   151000
3297            Data Scientist   105000
3298     Business Data Analyst   100000
3299      Data Science Manager  7000000

[3300 rows x 2 columns]

In [6]:
emprego_salaries= df1.groupby('Job Title')

In [7]:
emprego_salaries.mean()

                                        Salary
Job Title
AI Architect                     233500.000000
AI Developer                     133666.666667
AI Programmer                     62500.000000
AI Scientist                     263444.444444
AWS Data Architect               258000.000000
...                                        ...
Sales Data Analyst                60000.000000
Software Data Engineer           120000.000000
Staff Data Analyst                97499.000000
Staff Data Scientist             134500.000000
Staff Machine Learning Engineer  185000.000000

[111 rows x 1 columns]

In [8]:
df2=salaries_df[['Salary', 'Company Size']]
tamanho_salario=df2.groupby('Company Size')
tamanho_salario.describe()

              Salary                                                  \
               count           mean           std      min       25%
Company Size
Large          442.0  459661.271493  1.827753e+06  15000.0   76190.0
Medium        2707.0  158990.875877  1.877487e+05  15000.0  100000.0
Small          151.0  276999.874172  9.808789e+05  14000.0   50000.0


                   50%       75%         max
Company Size
Large         121000.0  195400.0  30400000.0
Medium        144100.0  191300.0   6600000.0
Small          80000.0  125202.0   8500000.0

In [9]:
df3=salaries_df[['Company Location','Salary']]
localizacao_salario=df3.groupby('Company Location')
resultado=localizacao_salario.mean()
resultado_ordenado = resultado.sort_values(by='Salary', ascending=False)
print(resultado_ordenado)

                            Salary
Company Location
Chile                 3.040000e+07
Hungary               8.800000e+06
Japan                 3.264000e+06
India                 2.282000e+06
Indonesia             2.107500e+06
...                            ...
Malta                 2.400000e+04
Egypt                 2.280000e+04
Honduras              2.000000e+04
Moldova, Republic of  1.800000e+04
Ecuador               1.600000e+04

[71 rows x 1 columns]

### 2.1.2 Pivot Table

Serve para reorganizar os dados de um DataFrame com base em uma ou mais colunas categoricas.

Pergunta: "Quero saber a variacao de salarios em media das profissoes  ao longo do tempo"

In [10]:
df4= salaries_df[['Year','Salary','Job Title']] 
df5=df4.pivot_table(index='Job Title', columns='Year', values='Salary')
df5

Year,2020,2021,2022,2023
Job Title,,,,
AI Architect,NaN,NaN,NaN,233500.000000
AI Developer,NaN,NaN,275000.0,116000.000000
AI Programmer,NaN,NaN,40000.0,70000.000000
AI Scientist,300000.0,473333.333333,140625.0,316166.666667
AWS Data Architect,NaN,NaN,NaN,258000.000000
...,...,...,...,...
Sales Data Analyst,60000.0,NaN,NaN,NaN
Software Data Engineer,NaN,NaN,NaN,120000.000000
Staff Data Analyst,15000.0,NaN,NaN,179998.000000
Staff Data Scientist,164000.0,105000.000000,NaN,NaN
Staff Machine Learning Engineer,NaN,185000.000000,NaN,NaN

In [11]:
df4.pivot_table(index='Job Title', columns='Year', values='Salary', aggfunc=['max', 'min'])

                                      max                                  \
Year                                 2020       2021      2022       2023
Job Title
AI Architect                          NaN        NaN       NaN   330000.0
AI Developer                          NaN        NaN  275000.0   200000.0
AI Programmer                         NaN        NaN   40000.0   100000.0
AI Scientist                     300000.0  1335000.0  200000.0  1500000.0
AWS Data Architect                    NaN        NaN       NaN   258000.0
...                                   ...        ...       ...        ...
Sales Data Analyst                60000.0        NaN       NaN        NaN
Software Data Engineer                NaN        NaN       NaN   210000.0
Staff Data Analyst                15000.0        NaN       NaN   179998.0
Staff Data Scientist             164000.0   105000.0       NaN        NaN
Staff Machine Learning Engineer       NaN   185000.0       NaN        NaN

                                      min
Year                                 2020      2021      2022      2023
Job Title
AI Architect                          NaN       NaN       NaN  200000.0
AI Developer                          NaN       NaN  275000.0   60000.0
AI Programmer                         NaN       NaN   40000.0   40000.0
AI Scientist                     300000.0   30000.0   30000.0   20000.0
AWS Data Architect                    NaN       NaN       NaN  258000.0
...                                   ...       ...       ...       ...
Sales Data Analyst                60000.0       NaN       NaN       NaN
Software Data Engineer                NaN       NaN       NaN   50000.0
Staff Data Analyst                15000.0       NaN       NaN  179998.0
Staff Data Scientist             164000.0  105000.0       NaN       NaN
Staff Machine Learning Engineer       NaN  185000.0       NaN       NaN

[111 rows x 8 columns]

### 2.1.3 Melt

A função 'melt' no pandas é usada para transformar um DataFrame de formato largo (wide) em um formato longo (tidy). Essa função é útil quando você precisa desagregar e reestruturar os dados para análises mais eficientes.

In [12]:
df5.melt(ignore_index=False)

                                 Year     value
Job Title
AI Architect                     2020       NaN
AI Developer                     2020       NaN
AI Programmer                    2020       NaN
AI Scientist                     2020  300000.0
AWS Data Architect               2020       NaN
...                               ...       ...
Sales Data Analyst               2023       NaN
Software Data Engineer           2023  120000.0
Staff Data Analyst               2023  179998.0
Staff Data Scientist             2023       NaN
Staff Machine Learning Engineer  2023       NaN

[444 rows x 2 columns]

### 2.2.1 Diff

##### A função diff serve para calcular a diferença entre os valores de uma linha ou coluna, de acordo com os parâmetros definidos previamente.

Para compreender como funciona a função diff, criaremos um DataFrame com dados da receita de três unidades de uma loja ao longo do mês de junho.

In [ ]:
#CRIANDO O DATAFRAME

#Definir uma "seed" tem a função de garantir que os números sejam aleatórios, mas reproduzível, o que significa que executando o código várias vezes o gerador de números aleatórios não vai mudar. 42 é apenas uma escolha popular entre os usuários de python, mas qualquer outro número inteiro poderia ser escolhido
np.random.seed(42)

#Dados: Receita(v.a)~Normal(1000,100)
receita = np.random.normal(loc=1000, scale=100, size=(30, 3))
#Colunas:
unidade = ('Centro', 'Butantã', 'Paulista')
#Índices:
data = [pd.date_range(start=pd.Timestamp('2023-06-01'), end=pd.Timestamp('2023-06-30'), freq='D')]

df = pd.DataFrame(data=receita, columns=unidade, index=data)
df = df.round()
print(df)

In [ ]:
df.diff()

In [ ]:
df.diff().describe()

In [ ]:
#diff calculará diferença entre receita atual e receita de dois dias atrás
df.diff(periods=2)

In [ ]:
## diff calculará diferença por coluna, ou seja, por unidade
df.diff(periods=1,axis=1).dropna(axis=1)

### 2.2.2 Pct_change

##### A função pct_change serve para calcular a **diferença percentual** entre os valores de uma linha ou coluna, de acordo com os parâmetros definidos previamente.

A partir do mesmo DataFrame, vamos agora analisar como funciona a função *pct_change*:

In [ ]:
df.pct_change().round(2)

In [ ]:
df.pct_change().describe().round(2)

In [ ]:
df.pct_change(periods=1, axis=1).dropna(axis=1).round(2)

## 3. Aplicações Úteis

### 3.1 Cálculo de Retorno

### 3.2 Cálculo Para Cada Fundo

### 3.3 Juntando os Resultados

![](joins.png)